wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    SPIM_Set_Write_Enable(spim, 1, u32NBit);           /* Write Enable.    */

    cmdBuf[buf_idx++] = u8ErsCmd;

    if (is4ByteAddr)
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 24);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr & 0xFFUL);
    }
    else
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr & 0xFFUL);
    }

    SPIM_SET_SS_EN(spim, 1);                      /* CS activated.    */
    SwitchNBitOutput(spim, u32NBit);
    spim_write(spim, cmdBuf, buf_idx);
    SPIM_SET_SS_EN(spim, 0);                      /* CS deactivated.  */

    if (isSync)
    {
        SPIM_Wait_Write_Done(spim, u32NBit);
    }
}

/** @cond HIDDEN_SYMBOLS */
/**
 * @brief Swich DMA/DMM Phase Setting Register
 * @param      spim
 * @param u32OPMode SPI Function Operation Mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEWRITE : DMA Write mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA Read mode
 *                  - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Memory Mapping mode
 * @return     PHDMAW/PHDMAR/PHDMM Register Address
 */
static void *SPIM_SwitchPhaseRegister(SPIM_T *spim, uint32_t u32OPMode)
{
    switch (u32OPMode)
    {
        case SPIM_CTL0_OPMODE_PAGEWRITE:
            return (uint32_t *)&spim->PHDMAW;
            break;

        case SPIM_CTL0_OPMODE_PAGEREAD:
            return (uint32_t *)&spim->PHDMAR;
            break;

        case SPIM_CTL0_OPMODE_DIRECTMAP:
            return (uint32_t *)&spim->PHDMM;
            break;

        default:
            break;
    }

    return NULL;
}

/**
  * @brief      Write data in the same page by I/O mode.
  * @param      u32Addr     Start u32Address to write.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32NTx      Number of bytes to write.
  * @param      pu8TxBuf    Transmit buffer.
  * @param      wrCmd       Write command.
  * @param      u32NBitCmd  N-bit transmit command.
  * @param      u32NBitAddr N-bit transmit u32Address.
  * @param      u32NBitDat  N-bit transmit/receive data.
  * @param      isSync      Block or not.
  * @return     None.
  */
static void SPIM_WriteInPageDataByIO(SPIM_T *spim, uint32_t u32Addr,
                                     int is4ByteAddr, uint32_t u32NTx,
                                     uint8_t pu8TxBuf[], uint8_t wrCmd,
                                     uint32_t u32NBitCmd, uint32_t u32NBitAddr,
                                     uint32_t u32NBitDat, uint32_t u32DTREn, int isSync)
{
    uint8_t cmdBuf[16];
    uint32_t buf_idx;
    uint32_t u32TxSize = 1UL;

    SPIM_Set_Write_Enable(spim, 1, u32NBitCmd);         /* Write Enable. */

    SPIM_SET_DTR_MODE(spim, u32DTREn);                  /* DTR Activated. */

    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);               /* CS activated. */

    SwitchNBitOutput(spim, u32NBitCmd);
    cmdBuf[0] = wrCmd;

    if (u32DTREn == SPIM_OP_ENABLE)
    {
        cmdBuf[1] = wrCmd;
        u32TxSize = 2UL;
    }

    spim_write(spim, cmdBuf, u32TxSize);                /* Write out command. */

    buf_idx = 0UL;

    if (is4ByteAddr)
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 24);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t) u32Addr;
    }
    else
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t) u32Addr;
    }

    SwitchNBitOutput(spim, u32NBitAddr);
    spim_write(spim, cmdBuf, buf_idx);                  /* Write out u32Address. */

    SwitchNBitOutput(spim, u32NBitDat);
    spim_write(spim, pu8TxBuf, u32NTx);                 /* Write out data.  */

    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);              /* CS deactivated.  */

    SPIM_SET_DTR_MODE(spim, SPIM_OP_DISABLE);           /* DTR Deactivated. */

    if (isSync)
    {
        SPIM_Wait_Write_Done(spim, u32NBitCmd);
    }
}

/**
  * @brief      Write data in the same page by Page Write mode.
  * @param      u32Addr     Start u32Address to write.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32NTx      Number of bytes to write.
  * @param      pu8TxBuf    Transmit buffer.
  * @param      wrCmd       Write command.
  * @param      isSync      Block or not.
  * @return     SPIM_OK          SPIM operation OK.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  */
static int SPIM_WriteInPageDataByPageWrite(SPIM_T *spim, uint32_t u32Addr,
                                           int is4ByteAddr, uint32_t u32NTx,
                                           uint8_t pu8TxBuf[], uint32_t wrCmd,
                                           int isSync)
{
    SPIM_Set_Write_Enable(spim, 1, 1);                  /* Write Enable. */

    SPIM_SET_4BYTE_ADDR_EN(spim, is4ByteAddr);          /* Enable/disable 4-Byte Address. */

    SPIM_SET_SPIM_MODE(spim, wrCmd);                    /* SPIM mode. */
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_PAGEWRITE);  /* Switch to Page Write mode. */

    spim->SRAMADDR = (uint32_t)pu8TxBuf;                /* SRAM u32Address. */
    spim->DMACNT = u32NTx;                              /* Transfer length. */
    spim->FADDR = u32Addr;                              /* Flash u32Address.*/

    if (SPIM_WaitSPIMENDone(spim, isSync) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    SPIM_Wait_Write_Done(spim, 1);

    return SPIM_OK;
}

/**
 * @brief Calculate I/O phase bit mode size.
 *
 * @param u32Phase
 *          - \ref PHASE_NORMAL_MODE : 1 Bit Mode
 *          - \ref PHASE_DUAL_MODE   : 2 Bit Mode
 *          - \ref PHASE_QUAD_MODE   : 4 Bit Mode
 *          - \ref PHASE_OCTAL_MODE  : 8 Bit Mode
 * @return uint32_t Phase Size
 */
static uint32_t SPIM_GetIOPhaseSize(uint32_t u32Phase)
{
    switch (u32Phase)
    {
        case PHASE_DUAL_MODE:
            return 2;

        case PHASE_QUAD_MODE:
            return 4;

