wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    /* Set DMA/DMM Continue Read Phase */
    SPIM_DMADMM_SetContReadPhase(spim,
                                 u32OPMode,
                                 psPhaseTable->u32RdModePhase,
                                 psPhaseTable->u32RdModeWidth,
                                 psPhaseTable->u32RdModeDTR);

    if (psPhaseTable->u32RdModeOn == PHASE_READMODE_ON)
    {
        if (u32OPMode == SPIM_CTL0_OPMODE_DIRECTMAP)
        {
            SPIM_ENABLE_DMM_CREN(spim);
        }

        /* Enable Contiue Read Mode */
        SPIM_SET_MODE_DATA(spim, CMD_CONTINUE_READ_MODE);
    }

    if (psPhaseTable->u32DataPhase == PHASE_OCTAL_MODE)
    {
        u32RDQSOn = 1;
    }

    /* Set Flash Data Phase */
    SPIM_DMADMM_SetDataPhase(spim,
                             u32OPMode,
                             psPhaseTable->u32DataPhase,
                             psPhaseTable->u32ByteOrder,
                             u32RDQSOn,
                             psPhaseTable->u32DataDTR);

    /* Set Dummy Cycle After Address. */
    if (u32OPMode == SPIM_CTL0_OPMODE_PAGEREAD)
    {
        SPIM_SET_DMAR_DC(spim, psPhaseTable->u32DcNum);
    }
    else if (u32OPMode == SPIM_CTL0_OPMODE_DIRECTMAP)
    {
        SPIM_SET_DMM_DC(spim, psPhaseTable->u32DcNum);
    }
}

/**
 * @brief   Set DMA write phase and DMA write data
 *
 * @param spim
 * @param psPhaseTable  Check SPI Flash specifications for support command codes,
 *                      and create command phase table.
 * @param u32Addr       Write Address.
 * @param is4ByteAddr   Enable 4 Bytes Address Mode.
 * @param u32WrSize     Write Data Size.
 * @param pvTxBuf       Write Data Buffer.
 */
void SPIM_DMA_WritePhase(SPIM_T *spim, PHASE_SET_T *psPhaseTable,
                         uint32_t u32Addr, int is4ByteAddr, uint32_t u32WrSize,
                         void *pvTxBuf)
{
    SPIM_DMADMM_InitPhase(spim, psPhaseTable, SPIM_CTL0_OPMODE_PAGEWRITE);

    SPIM_DMA_Write(spim,
                   u32Addr,
                   is4ByteAddr,
                   u32WrSize,
                   (uint8_t *)pvTxBuf,
                   psPhaseTable->u32CMDCode);
}

/**
 * @brief   Set DMA read phase andd DMA read data
 *
 * @param spim
 * @param psPhaseTable  Check SPI Flash specifications for support command codes,
 *                      and create command phase table.
 * @param u32Addr       Read SPI Flash Address.
 * @param is4ByteAddr   Enable 4 Bytes Address.
 * @param u32RdSize     Read Data Size.
 * @param pvRxBuf       Read Data Buffer.
 * @param isSync        Wait SPIM Enable Done
 * @return int32_t
 */
int32_t SPIM_DMA_ReadPhase(SPIM_T *spim, PHASE_SET_T *psPhaseTable,
                           uint32_t u32Addr, int is4ByteAddr, uint32_t u32RdSize,
                           void *pvRxBuf, int isSync)
{
    SPIM_DMADMM_InitPhase(spim, psPhaseTable, SPIM_CTL0_OPMODE_PAGEREAD);

    return SPIM_DMA_Read(spim,
                         u32Addr,
                         is4ByteAddr,
                         u32RdSize,
                         (uint8_t *) pvRxBuf,
                         psPhaseTable->u32CMDCode,
                         isSync);
}

/**
 * @brief   Set Direct Map phase and enter direct map mode
 *
 * @param spim
 * @param psPhaseTable  Check SPI Flash specifications for support command codes,
 *                      and create command phase table.
 * @param is4ByteAddr   Enable 4 Bytes Address.
 * @param u32IdleIntvl  Direct Map Mode Idle Interval Time.
 */
void SPIM_DMM_ReadPhase(SPIM_T *spim, PHASE_SET_T *psPhaseTable, int is4ByteAddr, uint32_t u32IdleIntvl)
{
    SPIM_DMADMM_InitPhase(spim, psPhaseTable, SPIM_CTL0_OPMODE_DIRECTMAP);

    SPIM_EnterDirectMapMode(spim, is4ByteAddr, psPhaseTable->u32CMDCode, u32IdleIntvl);
}

/**
 * @brief Normal mode data phase
 *
 * @param spim
 * @param u8TRxBuf      Read/Write Data Buffer
 * @param u32TRxSize    Read/Write Data Size
 * @param u32DataPhase  Command Bit Mode
 *                      - \ref PHASE_NORMAL_MODE : Send Command Use Standard Mode
 *                      - \ref PHASE_DUAL_MODE   : Send Command Use Dual Mode
 *                      - \ref PHASE_QUAD_MODE   : Send Command Use Quad Mode
 *                      - \ref PHASE_OCTAL_MODE  : Send Command Use Octal Mode
 * @param u32DTREn      DTR mode
 *                      - \ref SPIM_OP_ENABLE  : Enable
 *                      - \ref SPIM_OP_DISABLE : Disable
 * @param isSync        sync write done
 *                      - \ref 0 : read mode
 *                      - \ref 1 : write mode and wait write done
 */
void SPIM_IO_SendDataPhase(SPIM_T *spim, uint8_t u8TRxBuf[], uint32_t u32TRxSize,
                           uint32_t u32DataPhase, uint32_t u32DTREn, uint32_t isSync)
{
    SPIM_SET_DTR_MODE(spim, u32DTREn); /* DTR Activated. */
    //SPIM_SET_RDQS_MODE(spim, u32DTREn);

    if (isSync == 1)
    {
        SwitchNBitOutput(spim, SPIM_GetIOPhaseSize(u32DataPhase));
        spim_write(spim, u8TRxBuf, u32TRxSize);     /* Write out data.  */
    }
    else
    {
        SwitchNBitInput(spim, SPIM_GetIOPhaseSize(u32DataPhase));
        spim_read(spim, u8TRxBuf, u32TRxSize);      /* Read back data.  */
    }

    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);          /* CS Deactivated. */
    SPIM_SET_DTR_MODE(spim, SPIM_OP_DISABLE);       /* DTR Deactivated. */
    SPIM_SET_RDQS_MODE(spim, SPIM_OP_DISABLE);

    if (isSync)
    {
        SPIM_Wait_Write_Done(spim, u32DataPhase);
    }
}

/**
 * @brief Send dummy cycle clock through normal mode
 *
 * @param spim
 * @param u32NDummy dummy clocks, reference SPI flash command specification
 * @return int32_t
 */
int32_t SPIM_IO_SendDummyCycle(SPIM_T *spim, int u32NDummy)
{
    uint32_t u32i = 0;

    if (u32NDummy == 0)
    {
        return SPIM_OK;
    }

    SPIM_SET_DTR_MODE(spim, SPIM_OP_DISABLE);       /* DTR Deactivated. */
    SwitchNBitOutput(spim, 1);
    spim->TX[0] = 0x00;

    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);     /* Switch to Normal mode. */
    SPIM_SET_DATA_WIDTH(spim, u32NDummy);
    SPIM_SET_BURST_DATA(spim, 1UL);

