wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    if (SPIM_WaitSPIMENDone(spim, 1) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}


void SPIM_IO_SendAddrPhase(SPIM_T *spim,
                           uint32_t u32Is4ByteAddr,
                           uint32_t u32Addr,
                           uint32_t u32AddrPhase,
                           uint32_t u32RdMode,
                           uint32_t u32DTREn)
{
    uint8_t u8CmdBuf[8] = {0};
    uint8_t u8BufIdx = 0;

    SPIM_SET_DTR_MODE(spim, u32DTREn); /* DTR Activated. */

    if (u32Is4ByteAddr)
    {
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 24);
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 16);
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 8);
        u8CmdBuf[u8BufIdx++] = (uint8_t) u32Addr;
    }
    else
    {
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 16);
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 8);
        u8CmdBuf[u8BufIdx++] = (uint8_t) u32Addr;
    }

    if ((SPIM_GetIOPhaseSize(u32AddrPhase) == 2) ||
            (SPIM_GetIOPhaseSize(u32AddrPhase) == 4))
    {
        if (u32RdMode == PHASE_READMODE_ON)
        {
            u8CmdBuf[u8BufIdx++] = CMD_CONTINUE_READ_MODE;
        }
        else
        {
            u8BufIdx++;
        }
    }

    SwitchNBitOutput(spim, SPIM_GetIOPhaseSize(u32AddrPhase));
    spim_write(spim, u8CmdBuf, u8BufIdx);       /* Write out u32Address. */

    SPIM_SET_DTR_MODE(spim, SPIM_OP_DISABLE);   /* DTR Deactivated. */
}

void SPIM_IO_SendCMDPhase(SPIM_T *spim, uint32_t u32OpCMD, uint32_t u32CMDPhase,
                          uint32_t u32DTREn, uint32_t isSync)
{
    uint8_t u8CmdBuf[2] = {0};
    uint8_t u8CmdSize = 1UL;

    if (isSync == 1)
    {
        /* Write Enable. */
        SPIM_Set_Write_Enable(spim, 1, SPIM_GetIOPhaseSize(u32CMDPhase));
    }

    SPIM_SET_DTR_MODE(spim, u32DTREn);          /* DTR Activated. */

    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);       /* CS activated. */

    u8CmdBuf[0] = (u32OpCMD & 0xFF);

    if (u32DTREn == 1)
    {
        u8CmdBuf[1] = (u32OpCMD & 0xFF);
        u8CmdSize = 2UL;
    }

    SwitchNBitOutput(spim, SPIM_GetIOPhaseSize(u32CMDPhase));

    spim_write(spim, u8CmdBuf, u8CmdSize);      /* Write out command. */

    SPIM_SET_DTR_MODE(spim, SPIM_OP_DISABLE);   /* DTR Deactivated. */
}


void SPIM_WriteInPageDataByPhaseIO(SPIM_T *spim, PHASE_SET_T *psPhaseTable,
                                   uint32_t u32Addr, int is4ByteAddr,
                                   uint8_t *pu8RxBuf, uint32_t u32RdSize)
{
    SPIM_IO_SendCMDPhase(spim,
                         psPhaseTable->u32CMDCode,
                         psPhaseTable->u32CMDPhase,
                         psPhaseTable->u32CMDDTR,
                         1);

    SPIM_IO_SendAddrPhase(spim,
                          is4ByteAddr,
                          u32Addr,
                          psPhaseTable->u32AddrPhase,
                          psPhaseTable->u32RdModeOn,
                          psPhaseTable->u32AddrDTR);

    /* Write out dummy bytes. */
    SPIM_IO_SendDummyCycle(spim, psPhaseTable->u32DcNum);

    SPIM_IO_SendDataPhase(spim,
                          pu8RxBuf,
                          u32RdSize,
                          psPhaseTable->u32DataPhase,
                          psPhaseTable->u32DataDTR,
                          1);
}

void SPIM_IO_WritePhase(SPIM_T *spim, PHASE_SET_T *psPhaseTable,
                        uint32_t u32Addr, int is4ByteAddr,
                        uint8_t *pu8TxBuf, uint32_t u32WrSize)
{
    uint32_t  pageOffset, toWr;
    uint32_t  buf_idx = 0UL;

    pageOffset = u32Addr % 256UL;

    if ((pageOffset + u32WrSize) <= 256UL)          /* Do all the bytes fit onto one page ? */
    {
        SPIM_WriteInPageDataByPhaseIO(spim, psPhaseTable, u32Addr, is4ByteAddr, &pu8TxBuf[buf_idx], u32WrSize);
    }
    else
    {
        toWr = 256UL - pageOffset;               /* Size of data remaining on the first page. */

        SPIM_WriteInPageDataByPhaseIO(spim, psPhaseTable, u32Addr, is4ByteAddr, &pu8TxBuf[buf_idx], toWr);
        u32Addr += toWr;                         /* Advance indicator.  */
        u32WrSize -= toWr;
        buf_idx += toWr;

        while (u32WrSize)
        {
            toWr = 256UL;

            if (toWr > u32WrSize)
            {
                toWr = u32WrSize;
            }

            SPIM_WriteInPageDataByPhaseIO(spim, psPhaseTable, u32Addr, is4ByteAddr, &pu8TxBuf[buf_idx], toWr);
            u32Addr += toWr;                 /* Advance indicator.  */
            u32WrSize -= toWr;
            buf_idx += toWr;
        }
    }
}

/**
  * @brief      Read data from SPI Flash by sending commands manually (I/O mode).
  * @param      u32Addr     Start u32Address to read.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32RdSize   Number of bytes to read.
  * @param      pu8RxBuf    Receive buffer.
  * @param      rdCmd       Read command.
  * @param      u32NBitCmd  N-bit transmit command.
  * @param      u32NBitAddr N-bit transmit u32Address.
  * @param      u32NBitDat  N-bit transmit/receive data.
  * @param      u32NDummy   Number of dummy bytes following address.
  * @param      u32DTREn    DTR mode
  *                         - \ref SPIM_OP_ENABLE  : Enable
  *                         - \ref SPIM_OP_DISABLE : disable
  * @return     None.
  */
void SPIM_IO_ReadPhase(SPIM_T *spim, PHASE_SET_T *psPhaseTable,
                       uint32_t u32Addr, int is4ByteAddr,
                       uint8_t *pu8RxBuf, uint32_t u32RdSize)
{
    SPIM_IO_SendCMDPhase(spim,
                         psPhaseTable->u32CMDCode,
                         psPhaseTable->u32CMDPhase,
                         psPhaseTable->u32CMDDTR,
                         0);

    SPIM_IO_SendAddrPhase(spim,
                          is4ByteAddr,
                          u32Addr,
                          psPhaseTable->u32AddrPhase,
                          psPhaseTable->u32RdModeOn,
                          psPhaseTable->u32AddrDTR);

