wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    spim->HYPER_CMD = SPIM_HYPER_CMD_WRITE_4_BYTE;

    if (SPIM_IsCMDIdle(spim) != SPIM_OK)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      Write data to HyperBus Module.
  * @param      u32Addr Start address to write.
  * @param      pvWrBuf Transmit buffer.
  * @param      u32NTx  Number of bytes to write.
  * @return     SPIM_OK          SPIM operation OK.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  * @note       This function sets SPIM_ERR_TIMEOUT, if waiting Hyper Chip time-out.
  */
int32_t SPIM_DMAWrite_Hyper(SPIM_T *spim, uint32_t u32Addr, void *pvWrBuf, uint32_t u32NTx)
{
    if (pvWrBuf == NULL)
    {
        return SPIM_ERR_FAIL;
    }

    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_PAGEWRITE);  /* Switch to DMA Write mode.   */

    spim->SRAMADDR = (uint32_t) pvWrBuf;                /* SRAM u32Address.  */
    spim->DMACNT = u32NTx;                              /* Transfer length.  */
    spim->FADDR = u32Addr;                              /* Flash u32Address. */

    if (SPIM_WaitSPIMENDone(spim, 1) != SPIM_OK)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      Read data from HyperBus Module.
  * @param      u32Addr Start address to read.
  * @param      pvRdBuf Receive buffer.
  * @param      u32NRx  Number of bytes to read.
  * @return     SPIM_OK          SPIM operation OK.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  * @note       This function sets SPIM_ERR_TIMEOUT, if waiting Hyper Chip time-out.
  */
int32_t SPIM_DMARead_Hyper(SPIM_T *spim, uint32_t u32Addr, void *pvRdBuf, uint32_t u32NRx)
{
    if (pvRdBuf == NULL)
    {
        return SPIM_ERR_FAIL;
    }

    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_PAGEREAD);   /* Switch to DMA Write mode.   */

    spim->SRAMADDR = (uint32_t) pvRdBuf;                /* SRAM u32Address. */
    spim->DMACNT = u32NRx;                              /* Transfer length. */
    spim->FADDR = u32Addr;                              /* Flash u32Address. */

    if (SPIM_WaitSPIMENDone(spim, 1) != SPIM_OK)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      SPIM Hyper Mode Enter DMM Mode
  * @param      spim
  * @return     None.
  * @note       This function sets SPIM_ERR_TIMEOUT if waiting Hyper Chip time-out.
  */
void SPIM_EnterDirectMapMode_Hyper(SPIM_T *spim)
{
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_DIRECTMAP);  /* Switch to DMA Write mode.   */
}

/**
  * @brief      SPIM Hyper Mode Exit DMM Mode
  * @param      spim
  * @return     None.
  * @note       This function sets SPIM_ERR_TIMEOUT if waiting Hyper Chip time-out.
  */
void SPIM_ExitDirectMapMode_Hyper(SPIM_T *spim)
{
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);       /* Switch back to Normal mode.  */
}

/**
  * @brief      Wait Hyper Direct Map Mode Read/Write Done.
  * @param      spim
  * @return     SPIM_OK          SPIM operation OK.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  * @note       This function sets SPIM_ERR_TIMEOUT, if waiting Hyper Chip time-out.
  */
int32_t SPIM_IsDMMDone_Hyper(SPIM_T *spim)
{
    volatile int32_t u32TimeOutCount = SPIM_TIMEOUT;

    SPIM_ENABLE_DMM_HYPDONE(spim);       /* HyperBus DMM Mode Done.  */

    while (SPIM_WAIT_DMM_HYPDONE(spim))
    {
        if (--u32TimeOutCount <= 0)
        {
            return SPIM_ERR_TIMEOUT;
        }
    }

    return SPIM_OK;
}

/** @} end of group SPIM_EXPORTED_FUNCTIONS */
/** @} end of group SPIM_Driver */
/** @} end of group Standard_Driver */
